OdDbSetBasePlotSettingsPE.setScaleFactor(OdRxObject*,System.Double)
\details
Sets the scale factor, as a floating point value, for the specified PlotSettings object.
\param pPlotSettings [in]  Pointer to the PlotSettings object.
\param dScaleFactor [in]  Scale factor.

OdDbSetBasePlotSettingsPE.setStdScaleType(OdRxObject*,OdDbBaseLayoutPE.StdScaleType)
\details
Sets the standard scale type for the specified PlotSettings object.
\param pPlotSettings [in]  Pointer to the PlotSettings object.
\param scaleType [in]  Standard scale type to be set.
\returns Returns eOk if successful or an appropriate error code otherwise.

OdDbSetBasePlotSettingsPE.setStyleSheet(OdRxObject*,OdString)
\details
Sets the current style sheet for the specified PlotSettings object.
\param pPlotSettings [in]  Pointer to the PlotSettings object.
\param styleSheet [in]  Name of current style sheet.
\returns Returns eOk if successful or an appropriate error code otherwise.

OdDbSetBasePlotSettingsPE.setPrintScale(OdRxObject*,System.Double,System.Double)
\details
Sets the custom print scale for the specified PlotSettings object.
\param pPlotSettings [in]  Pointer to the PlotSettings object.
\param numerator [in]  PaperSpace units.
\param denominator [in]  Media units.
\remarks
The custom print scale always reflects the scale that this PlotSettings object will use to plot.
\returns Returns eOk if successful or an appropriate error code otherwise.

OdDbSetBasePlotSettingsPE.setPlotView(OdRxObject*,OdDbStub*)
\details
Sets the plot view for the specified PlotSettings object.
\param pPlotSettings [in]  Pointer to the PlotSettings object.
\param plotViewId [in]  Plot view Object Id to set.
\returns Returns eOk if successful or an appropriate error code otherwise.

OdDbSetBasePlotSettingsPE.setPlotWindowArea(OdRxObject*,System.Double,System.Double,System.Double,System.Double)
\details
Sets the corners of the plot window area for the specified PlotSettings object.
\param pPlotSettings [in]  Pointer to the PlotSettings object.
\param xMin [in]  X-coordinate of the lower-left corner.
\param yMin [in]  Y-coordinate of the lower-left corner.
\param xMax [in]  X-coordinate of the upper-right corner.
\param yMax [in]  Y-coordinate of the upper-right corner.
\remarks
The corners define the area to be plotted if and only if plotType == kWindow.
\returns Returns eOk if successful or an appropriate error code otherwise.

OdDbSetBasePlotSettingsPE.setPlotType(OdRxObject*,OdDbBaseLayoutPE.PlotType)
\details
Sets the plot type for the specified PlotSettings object.
\param pPlotSettings [in]  Pointer to the PlotSettings object.
\param plotType [in]  Plot type.
\remarks
plotType must be one of the following:
Name        Value   Description
kDisplay    0       Display
kExtents    1       Extents
kLimits     2       Limits
kView       3       View
kWindow     4       Window
kLayout     5       Layout
\returns Returns eOk if successful or an appropriate error code otherwise.

OdDbSetBasePlotSettingsPE.setPlotRotation(OdRxObject*,OdDbBaseLayoutPE.PlotRotation)
\details
Sets the plot rotation for the specified PlotSettings object.
\param pPlotSettings [in]  Pointer to the PlotSettings object.
\param plotRotation [in]  Plot rotation.
\remarks
plotRotation must be one of the following:
Name         Value    Description
k0degrees    0        No rotation
k90degrees   1        90 CCW
k180degrees  2        Inverted
k270degrees  3        90 CW
\returns Returns eOk if successful or an appropriate error code otherwise.

OdDbSetBasePlotSettingsPE.setPlotPaperUnits(OdRxObject*,OdDbBaseLayoutPE.PlotPaperUnits)
\details
Sets the plot paper units for the specified PlotSettings object.
\param pPlotSettings [in]  Pointer to the PlotSettings object.
\param plotPaperUnits [in]  Plot paper units.
\remarks
The plot paper units determine the units of the margins, offsets, paper size, and drawing units.
plotPaperUnits must be one of the following:
Name            Value   Description
kInches         0       Inches
kMillimeters    1       Millimeters
kPixels         2       Pixels
\returns Returns eOk if successful or an appropriate error code otherwise.

OdDbSetBasePlotSettingsPE.setOrigin(OdRxObject*,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the plot origin for the specified PlotSettings object.
\param pPlotSettings [in] Pointer to the PlotSettings object.
\param origin [in]  Plot origin.
\remarks
The plot origin is measured with respect to the plot margin. All distances are returned in millimeters, regardless of the drawing units.
\returns Returns eOk if successful or an appropriate error code otherwise.

OdDbSetBasePlotSettingsPE.setMediaName(OdRxObject*,OdString)
\details
Sets the canonical (locale-independent) media name for the specified PlotSettings object.
\param pPlotSettings [in]  Pointer to the PlotSettings object.
\param mediaName [in]  Canonical media name (case-sensitive).
\remarks
The canonical media name is locale-independent.
\returns Returns eOk if successful or an appropriate error code otherwise.

OdDbSetBasePlotSettingsPE.setPlotPaperSize(OdRxObject*,System.Double,System.Double)
\details
Sets the size of the paper for the specified PlotSettings object.
\param pPlotSettings [in] Pointer to the PlotSettings object.
\param paperWidth [in] Sets the paper width.
\param paperHeight [in] Sets the paper height.
\remarks
Paper size is the physical paper size and includes margins.
All distances are returned in millimeters, regardless of the drawing units.
\returns Returns eOk if successful or an appropriate error code otherwise.

OdDbSetBasePlotSettingsPE.setMargins(OdRxObject*,System.Double,System.Double,System.Double,System.Double)
\details
Sets the margins of the paper for the specified PlotSettings object.
\param pPlotSettings [in] Pointer to the PlotSettings object.
\param left [in] Sets the left margin.
\param Bottom [in] Sets the bottom margin.
\param right [in] Sets the right margin.
\param top [in] Sets the top margin.
\remarks
Margins are measured from their respective edges to the plot area and are independent of plot rotation.
All distances are returned in millimeters, regardless of the drawing units.
\returns Returns eOk if successful or an appropriate error code otherwise.

OdDbSetBasePlotSettingsPE.setPlotLayoutFlags(OdRxObject*,System.Int16)
\details
Sets plot layout flags for the specified PlotSettings object.
\param pPlotSettings [in] Pointer to the PlotSettings object.
\param flags [in] Plot layout flags to be set.
\returns Returns eOk if successful or an appropriate error code otherwise.

OdDbSetBasePlotSettingsPE.setPlotCfgName(OdRxObject*,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the plot device name for the specified PlotSettings object.
\param pPlotSettings [in]  Pointer to the PlotSettings object.
\param plotCfgName [in]  Name of the system printer or plot configuration PC3 file.
\returns Returns eOk if successful or an appropriate error code otherwise.